---
kind: method
id: M:Autodesk.Revit.DB.CitySet.ForwardIterator
source: html/76d21b21-dd48-3a31-643e-3869decd8865.htm
---
# Autodesk.Revit.DB.CitySet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CitySetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.